FactoryGirl.define do
  factory :horoscope do
    title "ОВЕН (21 марта - 20 апреля)"
    link "http://www.hyrax.ru/month.shtml"
    description "Овны начинают январь не в лучшей форме – сказывается усталость, накопившаяся за последний месяц ушедшего года. Именно поэтому представители знака не должны упускать возможность полноценно отдохнуть, сменить обстановку, возможно – совершить небольшое путешествие. Пополнение запасов энергии становится задачей первостепенной важности; пока она не будет решена, не рассчитывайте ни на успехи в делах, ни на какие-то значительные перемены в личной жизни. Январь – самое подходящее время для того, чтобы навести порядок в финансовых делах и составить план на год. Сейчас у вы настроены, во-первых, серьезно, а во-вторых, реалистично, что позволяет строить не воздушные замки, а куда более реальные вооружения. Говоря о сфере личных отношений, нельзя не отметить, что январь – это время, когда пробуждаются замершие было чувства. Многих Овнов одолевают ностальгические настроения, но представители знака не теряют здравого смысла и пытаются восстановить только то, что не было разрушено окончательно. Очень важно прислушиваться к своей интуиции: в январе она подскажет вам много хорошего. Самочувствие в январе будет неплохим, хотя в середине месяца не исключены простудные заболевания. В последние недели нежелательны занятия экстремальными видами спорта: повышается вероятность травм."
    category "Сегодня"
  end
end
