RE_COMMERCIAL_CATEGORIES = %w(Офис Торговля Промышленность Парковка Другое)
RE_TYPES = ["Сдаю в аренду", "Ищу в аренду", "Продаю", "Хочу купить"]
RE_DURATION = %w(почасово посуточно понедельно помесячно)

MODELS = [
  ["Частная", "RePrivate"],
  ["Коммерческая", "ReCommercial"],
  ["Услуги", "Service"],
  ["Работа", "Job"],
  ["Продается", "Sale" ]
]
ROOM_OPTIONS  = [
  "комната",
  "место в комнате",
  "студия",
  "1-спальная",
  "2-спальная",
  "3-спальная",
  "4-спальная",
  "5-спальная",
  "6-спальная",
  "7-спальная",
  "8-спальная",
  "9-спальная"
]

JOB_CATEGORIES = %w(Требуется Ищу)
JOB_SUBCATEGORIES = HashWithIndifferentAccess.new(
  "Туризм, Рестораны, Бары": [
    ["все", "администрация ресторана, официант, бармен, др, работники кухни, туризм"],
    "администрация ресторана",
    "официант, бармен",
    "работники кухни",
    "туризм"
  ],
  "Сельское хозяйство": [
    ["все", "агрономия, зоотехника и ветеринария"],
    "агрономия",
    "зоотехника и ветеринария"
  ],
  "Юриспруденция и Страхование": [
    ["все", "юристы, адвокаты, нотариусы, страхование, коллекторы, приставы, оценщики"],
    "юристы, адвокаты, нотариусы",
    "страхование, коллекторы, приставы, оценщики"
  ],
  "Спорт и Красота": [
    ["все", "визажист/косметолог, мастер маникюра / педикюра, парикмахер, стилист, парикмахер, стилист, танцовщицы, тренер, инструктор"],
    "визажист/косметолог",
    "мастер маникюра / педикюра",
    "парикмахер, стилист",
    "танцовщицы",
    "тренер, инструктор"
  ],
  "Банки, Финансы, Бухгалтерия": [
    ["все", "аудиторство, банки, кредитование, лизинг, бухгалтерия"],
    "аудиторство",
    "банки, кредитование, лизинг",
    "бухгалтерия"
  ],
  "Образование": [
    ["все", "преподаватели, репетиторы, дошкольное образование, иностранные языки, курсы, семинары, тренинги"],
    "преподаватели, репетиторы",
    "дошкольное образование",
    "иностранные языки",
    "курсы, семинары, тренинги"
  ],
  "Дизайн, Искусство, Развлечения": [
    ["все", "дизайн и графика, искусство, развлечения, фото, видео, аудио"],
    "дизайн и графика",
    "искусство",
    "развлечения",
    "фото, видео, аудио"
  ],
  "Транспорт и Логистика": [
    ["Все", "Автомойка, Автосервис, Водитель / Экспедитор, Логистика и Перевозки, Работник заправки"],
    "автомойка",
    "автосервис",
    "водитель / экспедитор",
    "логистика и перевозки",
    "работник заправки"
  ],
  "Медицина и Фармацевтика": [
    ["все", "массаж, медицинский персонал, фармацевтика"],
    "массаж",
    "медицинский персонал",
    "фармацевтика"
  ],
  "IT и Телекоммуникации": [
    ["все", "it программирование, it менеджмент, системное администрирование, телекоммуникации, ремонт компьютеров и телефонов, seo"],
    "it программирование",
    "it менеджмент",
    "системное администрирование",
    "телекоммуникации",
    "ремонт компьютеров и телефонов",
    "seo"
  ],
  "Производство, промышленность": [
    ["все", "инженеры/технологи производства, менеджмент производства, швейный бизнес, рабочие на производство"],
    "инженеры/технологи производства",
    "менеджмент производства",
    "швейный бизнес",
    "рабочие на производство"
  ],
  "Строительство и Недвижимость": [
    ["все", "недвижимость, проектирование и архитектура, производство стройматериалов, строительные специализации"],
    "недвижимость",
    "проектирование и архитектура",
    "производство стройматериалов",
    "строительные специализации"
  ],
  "СМИ, Журналистика, Переводы": [
    ["все", "ведущий, журналистика, переводчики, продюсер"],
    "ведущий",
    "журналистика",
    "переводчики",
    "продюсер"
  ],
  "Торговля и Продажи": [
    ["все", "менеджер по работе с клиентами, продавцы, кассиры, продажи по телефону (телемаркетинг), торговые представители, управление продажами"],
    "менеджер по работе с клиентами",
    "продавцы, кассиры",
    "продажи по телефону (телемаркетинг)",
    "торговые представители",
    "управление продажами"
  ],
  "Охрана и Безопасность": [
    ["все", "охранник / телохранитель, специалист по безопасности"],
    "охранник / телохранитель",
    "специалист по безопасности"
  ],
  "Персонал для дома и офиса": [
    ["все", "курьер, удаленная работа, няня, сиделка, офис-менеджер / секретарь, разнорабочие, уборщица/горничная"],
    "курьер",
    "удаленная работа",
    "няня, сиделка",
    "офис-менеджер / секретарь",
    "разнорабочие",
    "уборщица/горничная"
  ],
  "HR, Соц. работа": [
    ["все", "психология / соц. работа, hr, кадры"],
    "психология / соц. работа",
    "hr, кадры"
  ],
  "Маркетинг, Реклама, PR": [
    ["все", "копирайтинг / контент-менеджмент, маркетинг, промоутер, pr"],
    "копирайтинг / контент-менеджмент",
    "маркетинг",
    "промоутер",
    "pr"
  ],
  "Другое": [
    "другое"
  ]
)

SALE_CATEGORIES = [
  "Транспорт", "Для дома", "Для детей", "Одежда", "Электроника",
  "Домашние животные", "Растения", "Распродажа"
]

SERVICE_CATEGORIES = HashWithIndifferentAccess.new(
  "Автоуслуги": [
    "Авто в аренду",
    "Автосервисы",
    "Автомойки",
    "Автомагазины",
    "Автошколы",
    "Дилеры, аукционы",
    "Moving, грузоперевозки",
    "Такси, CarService"
  ],
  "Адвокаты": [
    "Общий профиль",
    "Аварии, Медицинские ошибки",
    "Бизнес, Финансы, Банкротство",
    "Нотариальные услуги",
    "Иммиграция",
    "Криминал",
    "Наследство, Завещания",
    "Недвижимость",
    "Семейное право"
  ],
  "Красота": [
    "Салоны красоты, парикмахерские",
    "SPA, солярий, массаж, уход за телом",
    "Коррекция фигуры и лица",
    "Эпиляция, лазерная косметология",
    "Татуировка, татуаж",
    "Бани, Сауны"
  ],
  "Медицина": [
    "Медицинский офис, Госпиталь",
    "Аптеки",
    "Альтернативная медицина",
    "Ветеринарные клиники",
    "Аллерголог",
    "Венеролог",
    "Гинеколог, акушер",
    "Дермотолог",
    "Диетолог",
    "Иммунолог",
    "Кардиолог",
    "Косметолог",
    "ЛОР",
    "Мануальный терапевт",
    "Невролог",
    "Стоматолог",
    "Онколог",
    "Ортопед",
    "Офтальмолог",
    "Педиатр",
    "Пластический хирург",
    "Психиатр, нарколог",
    "Психолог",
    "Сексопатолог",
    "Семейный доктор",
    "Терапевт",
    "Уролог, андролог",
    "Хирург, проктолог",
    "Физиотерапевт, массажист, хиропрактор",
    "Эндокринолог",
  ],
  "Недвижимость": [
    "Агентства Недвижимости",
    # "Финансирование"
  ],
  "Образование": [
    "Университеты, Колледжы, Школы",
    "Танцы, Музыка, Искусство",
    "Детские сады",
    "Курсы английского",
    "Репетиторы",
    "Спортивные школы",
    "Обучение профессии"
  ],
  "Работа": [
    "Агентства по Трудоустройству"
  ],
  "Ремонт": [
    "Ремонт и сервис телефонов",
    "Ремонт компьютеров",
    "Ремонт бытовой техники, электроники",
    "Ремонт, пошив одежды, обуви",
    "Ремонт, настройка музыкальных инструментов"
  ],
  "Строительство": [
    "Строительные компании",
    "Электрики",
    "Сантехники",
    "Маляры",
    "Мастер на все руки, Handyman",
    "Изготовление мебели",
    "Сигнализация, Видеонаблюдение",
    "Замки",
    "Заборы, Сварка",
    "Снос зданий, Мусор",
    "Ремонт и дизайн помещений",
    "Кондиционеры, Отопление"
  ],
  "Магазины": [
    "Детские товары",
    "Магазины с доставкой",
    "Зоотовары",
    "Интернет-магазины",
    "Канцелярские товары",
    "Книги, печатная продукция",
    "Одежда",
    "Обувь",
    "Парфюмерия и косметика",
    "Подарки, сувениры",
    "Продукты",
    "Сад и огород",
    "Ткани и товары для рукоделия",
    "Товары для спорта",
    "Хозтовары",
    "Цветы",
    "Часы",
    "Ювелирные изделия",
    "Автозапчасти"
  ],
  "Другие услуги": [
    "Артисты, праздники",
    "Бизнес, партнерства",
    "Детективы, охрана",
    "Истребление насекомых",
    "Компьютеры, интернет",
    "Няни, гувернантки",
    "Переводы, печатные работы",
    "Посылки, грузы",
    "Реклама и PR",
    "Рестораны, развлечения",
    "Ритуальные услуги",
    "Спорт, фитнес",
    "Сопровождение на встречах и отдыхе",
    "Страхование",
    "Туристические фирмы",
    "Танцы",
    "Уборка помещений",
    "Финансы, налоги",
    "Фото, Видео",
    "Художники, искусство",
    "Цветы",
    "Эротический Массаж",
    "Экстрасенсы"
  ]
)

STATES = [
  [ "Alabama", 1 ],
  [ "Alaska", 2 ],
  [ "Arizona", 3 ],
  [ "Arkansas", 4 ],
  [ "California", 5 ],
  [ "Colorado", 6 ],
  [ "Connecticut", 7 ],
  [ "Delaware", 8 ],
  [ "Florida", 9 ],
  [ "Georgia", 10 ],
  [ "Hawaii", 11 ],
  [ "Idaho", 12 ],
  [ "Illinois", 13 ],
  [ "Indiana", 14 ],
  [ "Iowa", 15 ],
  [ "Kansas", 16 ],
  [ "Kentucky", 17 ],
  [ "Louisiana", 18 ],
  [ "Maine", 19 ],
  [ "Maryland", 20 ],
  [ "Massachusetts", 21 ],
  [ "Michigan", 22 ],
  [ "Minnesota", 23 ],
  [ "Mississippi", 24 ],
  [ "Missouri", 25 ],
  [ "Montana", 26 ],
  [ "Nebraska", 27 ],
  [ "Nevada", 28 ],
  [ "New Hampshire", 29 ],
  [ "New Jersey", 30 ],
  [ "New Mexico", 31 ],
  [ "New York", 32 ],
  [ "North Carolina", 33 ],
  [ "North Dakota", 34 ],
  [ "Ohio", 35 ],
  [ "Oklahoma", 36 ],
  [ "Oregon", 37 ],
  [ "Pennsylvania", 38 ],
  [ "Rhode Island", 39 ],
  [ "South Carolina", 40 ],
  [ "South Dakota", 41 ],
  [ "Tennessee", 42 ],
  [ "Texas", 43 ],
  [ "Utah", 44 ],
  [ "Vermont", 45 ],
  [ "Virginia", 46 ],
  [ "Washington", 47 ],
  [ "West Virginia", 48 ],
  [ "Wisconsin", 49 ],
  [ "Wyoming", 50 ]
]

NEWS_CATEGORIES = [
  "https://news.yandex.ru/auto.rss",
  "https://news.yandex.ru/world.rss",
  "https://news.yandex.ru/internet.rss",
  "https://news.yandex.ru/movies.rss",
  "https://news.yandex.ru/fashion.rss",
  "https://news.yandex.ru/music.rss",
  "https://news.yandex.ru/science.rss",
  "https://news.yandex.ru/computers.rss",
   "https://news.yandex.ru/politics.rss",
   "https://news.yandex.ru/finances.rss",
   "https://news.yandex.ru/Belarus/index.rss",
   "https://news.yandex.ru/Israel/index.rss",
   "https://news.yandex.ru/Kazakhstan/index.rss",
   "https://news.yandex.ru/Moldova/index.rss",
   "https://news.yandex.ru/USA/index.rss",
   "https://news.yandex.ua/index.rss"
]

PARTNER_PAGES = HashWithIndifferentAccess.new(
      "Домашняя" => ["Домашняя"],
      "- Раздел Недвижимость" => [
        "Частная", "Коммерческая", "Агентства Недвижимости", "Финансирование"
      ],
      "- Раздел Работа" => ["Работа", "Агентства по Трудоустройству"],
      "- Раздел Вопросы" => ["Вопросы"],
      "- Раздел Новости" => ["Новости"],
      "- Раздел Продажи" => SALE_CATEGORIES,
      "- Раздел Услуги" => []
    )
SERVICE_CATEGORIES.each { |ctg, subctg| PARTNER_PAGES[ctg] = subctg }
