# frozen_string_literal: true

KINDS = %W(недвижимость работа услуги продажи).freeze

RP_SORT_OPTIONS = {
  "Сортировать": "",
  "Подешевле": "price asc",
  "Подороже": "case when price is null then -1 else price end desc",
  "Поновее": "created_at desc"
}.freeze

SALE_SORT_OPTIONS = {
  "Сортировать": "",
  "Подешевле": "price asc",
  "Подороже": "case when price is null then -1 else price end desc",
  "Поновее": "created_at desc"
}.freeze

RU_KINDS = HashWithIndifferentAccess.new(
  "работа" => {
    "categories" => [
      "требуется",
      "ищу-работу"
    ],
    "subcategories" => [
      "артисты--развлечения",
      "бары--кафе--рестораны",
      "водители",
      "грузчики",
      "искусство",
      "компьютеры--интернет",
      "массаж",
      "няни--сиделки--домработницы",
      "образование--учителя--воспитатели",
      "офис",
      "подработка",
      "переводчики",
      "персональный-помощник",
      "продавцы--кассиры--администраторы",
      "ремонт-установка-оборудования",
      "ремонт-автомобилей",
      "реклама--маркетинг",
      "строительство",
      "cалоны-красоты--парикмахерские",
      "спорт--здоровье",
      "танцовщицы",
      "уборка",
      "фото--видео--аудио",
      "другое-разное"
    ]
  },
  "недвижимость" => {
    "categories" => [
      "сдаю-в-аренду",
      "ищу-в-аренду",
      "продаю",
      "хочу-купить"
    ],
    "subcategories" => [
      "квартира",
      "коммерческая",
      "парковка",
      "другое-разное"
    ],
    "duration" => [
      "помесячно",
      "посуточно",
    ],
    "rooms" => [
      "место-в-комнате",
      "комната",
      "студия",
      "1-спальная",
      "2-спальная",
      "3-спальная",
      "4-спальная",
      "5-спальная"
    ]
  },
  "продажи" => {
    "categories" => [
      "продаю",
      "хочу-купить",
      "отдаю"
    ],
    "subcategories" => [
      "дети",
      "дом",
      "домашние-животные",
      "одежда",
      "растения",
      "транспорт",
      "электроника",
      "другое-разное"
    ]
  },
  "услуги" => {
    "categories" => [
      "автоуслуги",
      "адвокаты",
      "красота",
      "медицина",
      "недвижимость",
      "образование",
      "работа",
      "ремонт",
      "строительство--ремонт",
      "магазины",
      "другое-разное"
    ],
    "subcategories" => {
      "автоуслуги" => [
        "авто-в-аренду",
        "автосервисы",
        "автомойки",
        "автомагазины",
        "автошколы",
        "дилеры--аукционы",
        "грузоперевозки-moving",
        "такси-carservice"
      ],
      "адвокаты" => [
        "общий-профиль",
        "аварии--медицинские-ошибки",
        "бизнес--партнерства",
        "нотариальные-услуги",
        "иммиграция",
        "криминал",
        "наследство--завещания",
        "недвижимость",
        "семейное-право"
      ],
      "красота" => [
        "салоны-красоты--парикмахерские",
        "spa",
        "солярий",
        "массаж",
        "коррекция-фигуры-и-лица",
        "парикмахеры--стилисты--визажисты",
        "эпиляция--лазерная-косметология",
        "татуировка--татуаж"
      ],
      "медицина" => [
        "медицинский-офис--госпиталь",
        "аптеки",
        "альтернативная-медицина",
        "ветеринарные-клиники",
        "аллерголог",
        "венеролог",
        "гинеколог-акушер",
        "дермотолог",
        "диетолог",
        "иммунолог",
        "кардиолог",
        "косметолог",
        "лор",
        "мануальный-терапевт",
        "невролог",
        "стоматолог",
        "онколог",
        "ортопед",
        "офтальмолог",
        "педиатр",
        "пластический-хирург",
        "психиатр-нарколог",
        "психолог",
        "сексопатолог",
        "семейный-доктор",
        "терапевт",
        "уролог-андролог",
        "хирург-проктолог",
        "физиотерапевт-массажист-хиропрактор",
        "эндокринолог"
      ],
      "недвижимость" => [
        "агентства-недвижимости",
        "финансирование"
      ],
      "образование" => [
        "университеты--колледжы--школы",
        "танцы--музыка--искусство",
        "детские-сады",
        "курсы-английского",
        "репетиторы",
        "спортивные-школы",
        "специализированые-курсы"
      ],
      "работа" => [
        "агентства-по-трудоустройству"
      ],
      "ремонт" => [
        "ремонт-и-сервис-телефонов",
        "ремонт-компьютеров",
        "ремонт-бытовой-техники",
        "ремонт-пошив-одежды",
        "ремонт-обуви",
        "музыкальные инструменты"
      ],
      "строительство--ремонт" => [
        "строительные-компании",
        "электрики",
        "сантехники",
        "маляры",
        "мастер-на-все-руки--handyman",
        "изготовление-мебели",
        "сигнализация--видеонаблюдение",
        "замки",
        "заборы-сварка",
        "вывоз-мусора",
        "дизайн-помещений",
        "кондиционеры--отопление"
      ],
      "магазины" => [
        "автозапчасти",
        "детские-товары",
        "магазины-с-доставкой",
        "зоотовары",
        "канцелярские-товары",
        "книги--печатная-продукция",
        "одежда",
        "обувь",
        "парфюмерия--косметика",
        "подарки-сувениры",
        "продукты",
        "сад-и-огород",
        "ткани--товары-для-рукоделия",
        "хозтовары",
        "цветы",
        "ювелирные-изделия"
      ],
      "другое-разное" => [
        "артисты--праздники",
        "бизнес--партнерства",
        "бухгалтеры-финансы-налоги",
        "детективы--охрана",
        "дизайн",
        "истребление-насекомых",
        "компьютеры--интернет",
        "кондитеры",
        "няни--сиделки--домработницы",
        "отдых--развлечения",
        "переводы--печатные-работы",
        "посылки--грузы",
        "реклама--pr",
        "ритуальные-услуги",
        "спорт-фитнес",
        "сопровождение-на-встречах",
        "страхование",
        "туристические-фирмы",
        "танцы",
        "уборка-помещений",
        "фото--видео--аудио",
        "искусство",
        "цветы",
        "экстрасенсы",
        "другое-разное"
      ]
    }
  },
  "знакомства" => {},
  "посылки" => {}
)

VK_GROUPS = HashWithIndifferentAccess.new(
  "new-york": {
    id: 112797570,
    недвижимость: 33955066,
    работа: 33955064,
    продажи: 33955068,
    услуги: 33955067
  },
  "los-angeles": {
    id: 152834670,
    недвижимость: 35896322,
    работа: 35896319,
    продажи: 35896325,
    услуги: 35896324
  },
  "miami": {
    id: 152834973,
    недвижимость: 36276405,
    работа: 36276403,
    продажи: 36276407,
    услуги: 36276409,
  },
  "san-francisco": {
    id: 152835140,
    недвижимость: 35896345,
    работа: 35896343,
    продажи: 35896347,
    услуги: 35896348,
  },
  "boston": {
    id: 152835350,
    недвижимость: 35896366,
    работа: 35896364,
    продажи: 35896361,
    услуги: 35896360,
  },
  "chicago": {
    id: 152861099,
    недвижимость: 36036470,
    работа: 36036471,
    продажи: 36036474,
    услуги: 36036475,
  },
  "sacramento": {
    id: 152861486,
    недвижимость: 35571263,
    работа: 35571259,
    продажи: 35571262,
    услуги: 35571257,
  },
  "seattle": {
    id: 152861775,
    недвижимость: 35901394,
    работа: 35901395,
    продажи: 35901400,
    услуги: 35901396,
  },
  "jersey-city": {
    id: 152862013,
    недвижимость: 36277899,
    работа: 36277898,
    продажи: 36277901,
    услуги: 36277903,
  },
  "san-diego": {
    id: 152862295,
    недвижимость: 35901438,
    работа: 35901439,
    продажи: 35901441,
    услуги: 35901442,
  },
  "washington": {
    id: 152862591,
    недвижимость: 35740785,
    работа: 35740783,
    продажи: 35740787,
    услуги: 35740786,
  },
  "philadelphia": {
    id: 152862968,
    недвижимость: 35996984,
    работа: 35996985,
    продажи: 35996987,
    услуги: 35996986,
  },
  "houston": {
    id: 152879823,
    недвижимость: 36278972,
    работа: 36278974,
    продажи: 36278975,
    услуги: 36278977,
  }
)

FB_GROUPS = HashWithIndifferentAccess.new(
  "new-york": {
    page: 122705188385690,
    groups: {
      недвижимость: 1755700501389776,
      работа: 314607955670192
    }
  },
  "los-angeles": {
    page: 120701191988109,
    groups: {
      недвижимость: 277925862694235,
      работа: 133406473944427
    }
  },
  "miami": {
    page: 813235985517696,
    groups: {
      недвижимость: 331837187261009,
      работа: 299174873824715
    }
  },
  "san-francisco": {
    page: 817266231788228,
    groups: {
      недвижимость: 280209025793684,
      работа: 146873332576549
    }
  },
  "boston": {
    page: 1541982975862585,
    groups: {
      недвижимость: 113810086002164,
      работа: 115556339153532
    }
  },
  "chicago": {
    page: 350895042029552,
    groups: {
      недвижимость: 268929913595630,
      работа: 270840143430090
    }
  },
  "sacramento": {
    page: 1069540863183411,
    groups: {
      недвижимость: 1658179827547624,
      работа: 1721798724782260
    }
  },
  "seattle": {
    page: 1964635300487289,
    groups: {
      недвижимость: 338714789915465,
      работа: 145935439335459
    }
  },
  "jersey-city": {
    page: 1241770102635232,
    groups: {
      недвижимость: 114524029226519,
      работа: 152399852011153
    }
  },
  "san-diego": {
    page: 2050341935194831,
    groups: {
      недвижимость: 1958464831041781,
      работа: 167271293841351
    }
  },
  "washington": {
    page: 313480825786852,
    groups: {
      недвижимость: 1967025563582643,
      работа: 117161672266548
    }
  },
  "philadelphia": {
    page: 675177972687223,
    groups: {
      недвижимость: 1858090744507033,
      работа: 1759100461055467
    }
  },
  "houston": {
    page: 136107827000341,
    groups: {
      недвижимость: 113932205944372,
      работа: 258035031383638
    }
  }
).freeze
