DISTANCE = [1, 5, 10, 25, 50, 100, 150, 200, 300, 500]
NEWS_CATEGORIES = %w( Авто Забавное Здоровье Кино Культура Музыка Недвижимость
                      Общество Погода Политика Происшествия Путешествия Развитие
                      Семья Спорт Стиль Технологии Финансы Экономика )
RE_COMMERCIAL_CATEGORIES = %w(офис торговля промышленность парковка другое)
RE_TYPES = %w(продажа аренда)
RE_DURATION = %w(почасово посуточно помесячно)

JOB_TYPES = %w(требуется ищу)
JOB_CATEGORIES = [
  "Няня", "Сиделка", "Уборщица/горничная", "Курьер", "Удаленная",
  "Офис-менеджер", "Разнорабочие",
  "",
  "Автомойка", "Автосервис", "Водитель / Экспедитор", "Диспетчер",
  "Логистика и Перевозки", "Работник заправки",
  "",
  "Недвижимость", "Строительные специализации",
  "",
  "Банки, Кредитование, Лизинг", "Бухгалтерия", "Страхование", "Юриспруденция",
  "",
  "Инженеры/технологи производства", "Менеджмент производства",
  "Швейный бизнес", "Рабочие на производство",
  "",
  "Массаж", "Медицинский персонал", "Фармацевтика",
  "",
  "Дизайн и Графика", "Искусство", "Модели", "Артисты", "Развлечения",
  "Фото, видео, аудио",
  "",
  "Администрация ресторана", "Бармен", "Оффициант", "Работники кухни",
  "",
  "Визажист/Косметолог", "Мастер маникюра / педикюра", "Парикмахер, стилист",
  "",
  "Тренер, инструктор", "Воспитатель", "Преподавание",
  "",
  "Эскорт-сервис и массаж", "Охранники", "Туризм",
  "Программирование, компьютеры, интернет",
  "Торговля", "Маркетинг, Реклама, PR", "Временная, сезонная"
]

SALE_CATEGORIES = [
  "Все", "Транспорт", "Для дома", "Для детей", "Одежда", "Электроника",
  "Домашние животные, растения", "Распродажа"
]

SERVICE_CATEGORIES = HashWithIndifferentAccess.new(
  "Авто": [
    "Авто в аренду", "Автосервисы", "Автошкола", "Дилеры, акуцины",
    "Перевозки, moving", "Такси"
  ],
  "Адвокаты": [
    "Общий профиль", "Аварии, Медицинские ошибки",
    "Бизнес, Финансы, Банкроство", "Иммиграция", "Криминал",
    "Наследство, Завещания", "Недвижимость", "Семоейное право"
  ],
  "Косметология": [
    "Лазерная косметология", "Салоны красоты", "SPA, Бани, Сауны",
    "Пластическая хирургия"
  ],
  "Медицина": [
    "Медисцинский офис, Госптиаль", "Врач", "Аптеки", "Альтернативная медицина",
    "Ветеринарные клиники"
  ],
  "Образование": [
    "Университеты, Колледжы, Школы", "Танцы, Музыка, Искусство", "Десткие сады",
    "Курсы английского", "Репетиторы", "Спортивные школы", "Йога",
    "Обучение профессии"
  ],
  "Ремонт": [
    "Кондициоры, Отоплние", "Ремонт и сервис телефонов",
    "Ремонт бытовой техники, электроники", "Ремонт, пошив одежды",
    "Ремонт, настройка музыкальных инструментов"
  ],
  "Строительные работы": [
    "Строительные работы", "Эклектрики, Сантехники, Маляры и др",
    "Сигнализация, Видеонаблюдение", "Замки, Забры, Сварка",
    "Снос зданий, Мусор", "Архитектура, Дизайн", "Мастер на все руки"
  ],
  "Другие Услуги": [
    "Реклама и PR",
    "Туристические фирмы", "Уборка помещений", "Посылки, грузы", "Фото, Видео",
    "Артисты, праздники", "Компьтеры, интернет", "Истребление насекомых",
    "Детективы, охрана", "Переводы, печатные работы",
    "Сопровождение на встречах и отдыхе", "Массаж", "Няни, гувернантки"
  ]
)

STATES = [
  [ "Alabama", 1 ],
  [ "Alaska", 2 ],
  [ "Arizona", 3 ],
  [ "Arkansas", 4 ],
  [ "California", 5 ],
  [ "Colorado", 6 ],
  [ "Connecticut", 7 ],
  [ "Delaware", 8 ],
  [ "Florida", 9 ],
  [ "Georgia", 10 ],
  [ "Hawaii", 11 ],
  [ "Idaho", 12 ],
  [ "Illinois", 13 ],
  [ "Indiana", 14 ],
  [ "Iowa", 15 ],
  [ "Kansas", 16 ],
  [ "Kentucky", 17 ],
  [ "Louisiana", 18 ],
  [ "Maine", 19 ],
  [ "Maryland", 20 ],
  [ "Massachusetts", 21 ],
  [ "Michigan", 22 ],
  [ "Minnesota", 23 ],
  [ "Mississippi", 24 ],
  [ "Missouri", 25 ],
  [ "Montana", 26 ],
  [ "Nebraska", 27 ],
  [ "Nevada", 28 ],
  [ "New Hampshire", 29 ],
  [ "New Jersey", 30 ],
  [ "New Mexico", 31 ],
  [ "New York", 32 ],
  [ "North Carolina", 33 ],
  [ "North Dakota", 34 ],
  [ "Ohio", 35 ],
  [ "Oklahoma", 36 ],
  [ "Oregon", 37 ],
  [ "Pennsylvania", 38 ],
  [ "Rhode Island", 39 ],
  [ "South Carolina", 40 ],
  [ "South Dakota", 41 ],
  [ "Tennessee", 42 ],
  [ "Texas", 43 ],
  [ "Utah", 44 ],
  [ "Vermont", 45 ],
  [ "Virginia", 46 ],
  [ "Washington", 47 ],
  [ "West Virginia", 48 ],
  [ "Wisconsin", 49 ],
  [ "Wyoming", 50 ]
]
